# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv10.0n head
head:
  - [-1, 1, HFP, [None, [8, 8], False]] # 11-P5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12-P4
  - [6, 1, HFP, [None, [8, 8], False]] # 13-P4
  - [[-1, 12], 1, SDP, [512, [20, 20]]] # 14-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15-P3
  - [4, 1, HFP, [[0.25, 0.25], [8, 8], True]] # 16-P3
  - [[-1, 15], 1, SDP, [256, [20, 20]]] # 17-P3

  - [11, 1, nn.Upsample, [None, 2, "nearest"]] # 18-P4
  - [-1, 1, Conv, [512, 1]] # 19-P4
  - [[-1, 14], 1, Add, []] # 20-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 21-P3
  - [-1, 1, Conv, [256, 1]] # 22-P3
  - [[-1, 17], 1, Add, []] # 23-P3

  - [11, 1, Conv, [1024, 3]] # 24-P5
  - [20, 1, Conv, [512, 3]] # 25-P4
  - [23, 1, Conv, [256, 3]] # 26-P3

  - [[26, 25, 24], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
